<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('news')->insert([
            'img' => '',
            'title' => 'العقارات المستأجرة من قبل الجهات التابعة لوزارة النفط والثروة المعدنية و الجاهزة للإخلاء',
            'content' => 'إشارة إلى بلاغ رئاسة مجلس رقم 15/7 بتاريخ 5/3/2023 بخصوص ضوابط وإجراءات التخلية الادارية للمباني والعقارات المستأجرة من قبل الجهات العامة المشمولة بالتمديد الحكمي، والتي أعلنت الجهات العامة إمكانية الاستغناء عنها، وحرصا على ضمان اتخاذ الإجراءات المثلى فيما يتعلق بالإعلان يهم وزارة النفط والثروة المعدنية أن تنشر قائمة بالعقارات الجاهزة للإخلاء لدى الجهات التابعة لها حسب المحافظة ومع ذكر أسماء المالكين ، وذلك عملا بكتاب رئاسة مجلس الوزراء رقم 5395/1 تاريخ 27/4/2023 والمرفق ربطا صورة عنه.',
            'lang' => 'ar'
        ]);
        DB::table('news')->insert([
            'img' => '',
            'title' => 'صدور نتائج الثانوية المهنية في حمص -بانياس - الرميلان الدورة الأولى لعام 2023',
            'content' => 'صدور نتائج الثانوية المهنية (النفطية - مناجم وتعدين)   في حمص - بانياس والرميلان الدورة الأولى لعام 2023 وذلك بنسبة نجاح (%62,88).',
            'lang' => 'ar'
        ]);
        DB::table('news')->insert([
            'img' => '',
            'title' => 'صدور نتائج الثانوية المهنية في حمص -بانياس - الرميلان الدورة الثانية لعام 2023',
            'content' => 'صدور نتائج الثانوية المهنية (النفطية - مناجم وتعدين)   في حمص - بانياس والرميلان الدورة الثانية لعام 2023',
            'lang' => 'ar'
        ]);
    }
}
